LoadTesting/scripts/getAnnotationsForUser_Paged_500.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 33.296ms, rate sampling interval: 82ms
  Thread calibration: mean lat.: 24.444ms, rate sampling interval: 75ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    26.83ms   36.96ms 376.58ms   97.46%
    Req/Sec    32.28    184.91     1.42k    96.71%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   22.13ms
 75.000%   31.04ms
 90.000%   38.43ms
 99.000%  324.86ms
 99.900%  364.54ms
 99.990%  374.53ms
 99.999%  376.83ms
100.000%  376.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.063     0.000000            1         1.00
       7.647     0.100000         1865         1.11
      11.231     0.200000         3730         1.25
      14.711     0.300000         5586         1.43
      18.479     0.400000         7448         1.67
      22.127     0.500000         9309         2.00
      23.935     0.550000        10242         2.22
      25.711     0.600000        11173         2.50
      27.487     0.650000        12106         2.86
      29.263     0.700000        13035         3.33
      31.039     0.750000        13965         4.00
      31.919     0.775000        14430         4.44
      32.927     0.800000        14914         5.00
      33.983     0.825000        15372         5.71
      35.199     0.850000        15827         6.67
      36.639     0.875000        16291         8.00
      37.439     0.887500        16526         8.89
      38.431     0.900000        16759        10.00
      39.519     0.912500        16992        11.43
      40.991     0.925000        17222        13.33
      42.719     0.937500        17454        16.00
      43.807     0.943750        17570        17.78
      45.055     0.950000        17687        20.00
      46.751     0.956250        17806        22.86
      48.703     0.962500        17920        26.67
      52.703     0.968750        18036        32.00
      57.663     0.971875        18095        35.56
      65.055     0.975000        18152        40.00
      80.447     0.978125        18210        45.71
      98.623     0.981250        18268        53.33
     113.215     0.984375        18327        64.00
     118.655     0.985938        18360        71.11
     126.975     0.987500        18385        80.00
     306.431     0.989062        18414        91.43
     329.471     0.990625        18443       106.67
     336.383     0.992188        18472       128.00
     341.503     0.992969        18493       142.22
     344.063     0.993750        18501       160.00
     345.855     0.994531        18518       182.86
     349.183     0.995313        18530       213.33
     351.487     0.996094        18545       256.00
     353.791     0.996484        18552       284.44
     354.815     0.996875        18560       320.00
     355.583     0.997266        18567       365.71
     357.119     0.997656        18574       426.67
     359.935     0.998047        18581       512.00
     361.215     0.998242        18591       568.89
     361.215     0.998437        18591       640.00
     361.471     0.998633        18592       731.43
     364.287     0.998828        18597       853.33
     364.543     0.999023        18599      1024.00
     365.567     0.999121        18601      1137.78
     366.079     0.999219        18603      1280.00
     367.103     0.999316        18605      1462.86
     368.639     0.999414        18607      1706.67
     369.663     0.999512        18609      2048.00
     369.663     0.999561        18609      2275.56
     370.175     0.999609        18610      2560.00
     370.943     0.999658        18611      2925.71
     371.455     0.999707        18612      3413.33
     372.479     0.999756        18613      4096.00
     372.479     0.999780        18613      4551.11
     372.991     0.999805        18614      5120.00
     372.991     0.999829        18614      5851.43
     374.527     0.999854        18615      6826.67
     374.527     0.999878        18615      8192.00
     374.527     0.999890        18615      9102.22
     375.295     0.999902        18616     10240.00
     375.295     0.999915        18616     11702.86
     375.295     0.999927        18616     13653.33
     375.295     0.999939        18616     16384.00
     375.295     0.999945        18616     18204.44
     376.831     0.999951        18617     20480.00
     376.831     1.000000        18617          inf
#[Mean    =       26.834, StdDeviation   =       36.958]
#[Max     =      376.576, Total count    =        18617]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23657 requests in 5.00m, 11.67MB read
  Socket errors: connect 0, read 0, write 0, timeout 1260
Requests/sec:     78.85
Transfer/sec:     39.82KB