LoadTesting/scripts/getAnnotationsForUser_Paged_750.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 24.836ms, rate sampling interval: 73ms
  Thread calibration: mean lat.: 23.286ms, rate sampling interval: 67ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.86ms   57.81ms 490.75ms   95.51%
    Req/Sec    27.91    181.14     2.12k    97.33%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   21.73ms
 75.000%   30.05ms
 90.000%   38.81ms
 99.000%  366.08ms
 99.900%  480.26ms
 99.990%  488.45ms
 99.999%  491.01ms
100.000%  491.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.169     0.000000            1         1.00
       7.875     0.100000         1610         1.11
      11.519     0.200000         3221         1.25
      14.815     0.300000         4833         1.43
      18.335     0.400000         6441         1.67
      21.727     0.500000         8049         2.00
      23.439     0.550000         8855         2.22
      25.119     0.600000         9663         2.50
      26.703     0.650000        10467         2.86
      28.319     0.700000        11268         3.33
      30.047     0.750000        12073         4.00
      30.927     0.775000        12479         4.44
      31.871     0.800000        12880         5.00
      33.023     0.825000        13289         5.71
      34.431     0.850000        13687         6.67
      36.223     0.875000        14090         8.00
      37.311     0.887500        14288         8.89
      38.815     0.900000        14488        10.00
      40.991     0.912500        14690        11.43
      44.575     0.925000        14891        13.33
      52.223     0.937500        15092        16.00
      60.511     0.943750        15192        17.78
      75.775     0.950000        15293        20.00
      96.575     0.956250        15395        22.86
     130.239     0.962500        15494        26.67
     205.695     0.968750        15595        32.00
     224.895     0.971875        15645        35.56
     235.007     0.975000        15695        40.00
     245.631     0.978125        15745        45.71
     291.071     0.981250        15796        53.33
     326.911     0.984375        15848        64.00
     335.359     0.985938        15871        71.11
     347.647     0.987500        15898        80.00
     358.911     0.989062        15922        91.43
     371.967     0.990625        15948       106.67
     384.255     0.992188        15973       128.00
     391.935     0.992969        15985       142.22
     429.567     0.993750        15997       160.00
     440.575     0.994531        16009       182.86
     450.815     0.995313        16022       213.33
     456.447     0.996094        16035       256.00
     459.007     0.996484        16041       284.44
     464.639     0.996875        16047       320.00
     468.735     0.997266        16055       365.71
     470.527     0.997656        16061       426.67
     473.343     0.998047        16066       512.00
     474.367     0.998242        16070       568.89
     474.879     0.998437        16073       640.00
     475.903     0.998633        16075       731.43
     477.951     0.998828        16079       853.33
     480.511     0.999023        16083      1024.00
     480.511     0.999121        16083      1137.78
     482.047     0.999219        16085      1280.00
     482.815     0.999316        16086      1462.86
     483.071     0.999414        16088      1706.67
     484.095     0.999512        16090      2048.00
     484.095     0.999561        16090      2275.56
     485.375     0.999609        16091      2560.00
     485.631     0.999658        16092      2925.71
     486.911     0.999707        16093      3413.33
     487.679     0.999756        16094      4096.00
     487.679     0.999780        16094      4551.11
     487.679     0.999805        16094      5120.00
     488.447     0.999829        16095      5851.43
     488.447     0.999854        16095      6826.67
     490.239     0.999878        16096      8192.00
     490.239     0.999890        16096      9102.22
     490.239     0.999902        16096     10240.00
     490.239     0.999915        16096     11702.86
     490.239     0.999927        16096     13653.33
     491.007     0.999939        16097     16384.00
     491.007     1.000000        16097          inf
#[Mean    =       32.862, StdDeviation   =       57.808]
#[Max     =      490.752, Total count    =        16097]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23657 requests in 5.00m, 11.67MB read
  Socket errors: connect 0, read 0, write 0, timeout 1340
Requests/sec:     78.85
Transfer/sec:     39.81KB