LoadTesting/scripts/getBooksForUser_All_250.txt
Running 5m test
  2 threads and 10 connections
  Thread calibration: mean lat.: 6433.228ms, rate sampling interval: 19398ms
  Thread calibration: mean lat.: 6118.842ms, rate sampling interval: 18808ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.54m     1.27m    4.70m    58.62%
    Req/Sec     7.07      1.39    10.00     89.66%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.59m 
 75.000%    3.62m 
 90.000%    4.23m 
 99.000%    4.65m 
 99.900%    4.69m 
 99.990%    4.70m 
 99.999%    4.70m 
100.000%    4.70m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9945.087     0.000000            1         1.00
   47775.743     0.100000          442         1.11
   74186.751     0.200000          884         1.25
   99352.575     0.300000         1324         1.43
  125239.295     0.400000         1766         1.67
  155320.319     0.500000         2207         2.00
  173146.111     0.550000         2431         2.22
  184156.159     0.600000         2650         2.50
  193593.343     0.650000         2870         2.86
  204734.463     0.700000         3092         3.33
  217055.231     0.750000         3310         4.00
  225181.695     0.775000         3424         4.44
  229113.855     0.800000         3533         5.00
  235536.383     0.825000         3643         5.71
  241958.911     0.850000         3755         6.67
  247332.863     0.875000         3863         8.00
  251002.879     0.887500         3917         8.89
  253755.391     0.900000         3973        10.00
  256245.759     0.912500         4027        11.43
  261750.783     0.925000         4084        13.33
  266076.159     0.937500         4138        16.00
  268959.743     0.943750         4166        17.78
  270794.751     0.950000         4196        20.00
  272105.471     0.956250         4221        22.86
  273416.191     0.962500         4253        26.67
  274202.623     0.968750         4277        32.00
  274726.911     0.971875         4293        35.56
  275251.199     0.975000         4304        40.00
  276037.631     0.978125         4319        45.71
  276824.063     0.981250         4336        53.33
  277610.495     0.984375         4347        64.00
  277872.639     0.985938         4352        71.11
  278396.927     0.987500         4359        80.00
  278921.215     0.989062         4367        91.43
  279445.503     0.990625         4372       106.67
  279969.791     0.992188         4380       128.00
  280231.935     0.992969         4388       142.22
  280231.935     0.993750         4388       160.00
  280494.079     0.994531         4389       182.86
  280756.223     0.995313         4394       213.33
  281018.367     0.996094         4401       256.00
  281018.367     0.996484         4401       284.44
  281018.367     0.996875         4401       320.00
  281018.367     0.997266         4401       365.71
  281280.511     0.997656         4407       426.67
  281280.511     0.998047         4407       512.00
  281280.511     0.998242         4407       568.89
  281280.511     0.998437         4407       640.00
  281280.511     0.998633         4407       731.43
  281542.655     0.998828         4412       853.33
  281542.655     0.999023         4412      1024.00
  281542.655     0.999121         4412      1137.78
  281542.655     0.999219         4412      1280.00
  281542.655     0.999316         4412      1462.86
  281542.655     0.999414         4412      1706.67
  281542.655     0.999512         4412      2048.00
  281542.655     0.999561         4412      2275.56
  281542.655     0.999609         4412      2560.00
  281542.655     0.999658         4412      2925.71
  281542.655     0.999707         4412      3413.33
  281542.655     0.999756         4412      4096.00
  282066.943     0.999780         4413      4551.11
  282066.943     1.000000         4413          inf
#[Mean    =   152147.005, StdDeviation   =    76021.182]
#[Max     =   281804.800, Total count    =         4413]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4457 requests in 4.99m, 38.22MB read
  Socket errors: connect 0, read 0, write 0, timeout 27
Requests/sec:     14.88
Transfer/sec:    130.63KB